let prov = {
    ['Валенвуд']: [ "Сильвенар",
                    "Зелёный лес",
                    "Северный Валенвуд",
                    "Западный мыс",
                    "Затонувший берег",
                    "Длинный берег",
                    "Восточный Валенвуд"],
    ['Алинор']: ["Северный Ауридон",
        "Южный Ауридон",
        "Варилисс",
        "Оррери",
        "Регион Алинор",
        "Область Клаудрест",
        "Шиммерен",
        "Восточный полуостров"],
    ['Сиродиил']: ["Городской остров",
        "Графство Брума",
        "Графство Скинград",
        "Графство Кватч",
        "Графство Анвил",
        "Графство Бравил",
        "Графство Лейавин",
        "Графство Чейдинхол",
        "Графство Коррол",],
    ['Аргония']: ["Южный Индорил",
        "Торн",
        "Нага",
        "Топкие болота",
        "Гидеон",
        "Паатру",
        "Соулрест",
        "Лилмот",
        "Ан-Зайлиль",],
    ['Эльсвейр']: ["ГГ Риммен",
        "Западная Анеквина",
        "Пустыня Эльсвейра",
        "Северная Анеквина",
        "Регион Коринф",
        "Тенмарские леса",
        "Полуостров Куинравл",],
    ['Скайрим']: ["Хаафингар",
        "Предел",
        "Фолкрит",
        "Хьялмарк",
        "Вайтран",
        "Белый Берег",
        "Винтерхолд",
        "Истмарк",
        "Рифт",],
    ['Хаммерфелл']: ["Республика Элинир",
        "Регион Танет",
        "Республика Рихад",
        "Южный Скавен",
        "Республика Драгонстар",
        "Регион Хегат",
        "Регион Гилан",
        "Остров Стросс м'кай",
        "Сентинель и Алик'р",
        "Бангкорай",
        "Орсиниум",],
    ['Хай-рок']: ["Северный Камлорн",
        "Кор-во Даггерфолл",
        "Кор-во Вэйрест",
        "Южный Камлорн",
        "Кор-во Шорнхельм",
        "Кор-во Эвермор",
        "Кор-во Джеханна",
        "Кор-во Нортпойнт",
        "Кор-во Фаррун",],
    ['Морровинд']: ["Солстхейм",
        "Редоран",
        "Индорил",
        "Тель Митрин",
        "Острова Телванни",
        "Горы Боэтии",
        "Садрас",
        "Южный Телванни",]
}

let targets = {
    ["Сильвенар"]: ["Северный Валенвуд", "Зелёный лес", "Длинный берег", "Западная Анеквина"],
    ["Зелёный лес"]: ["Северный Валенвуд", "Сильвенар", "Длинный берег", "Западный мыс", "Затонувший берег"],
    ["Северный Валенвуд"]: ["Зелёный лес", "Сильвенар", "Графство Скинград", "Графство Кватч", "Северная Анеквина", "Западная Анеквина"],
    ["Западный мыс"]: ["Зелёный лес", "Затонувший берег"],
    ["Затонувший берег"]: ["Западный мыс", "Зелёный лес", "Длинный берег"],
    ["Длинный берег"]: ["Затонувший берег", "Зелёный лес", "Сильвенар", "Восточный Валенвуд", "Регион Коринф"],
    ["Восточный Валенвуд"]: ["Длинный берег", "Регион Коринф", "Тенмарские леса"],
}

function getOther(name, reg, arr) {

    let ks = []
    for (let f of name) {
        for (let i of prov[f]) {
            ks.push(i)
        }
    }
    let new_ks = ks.filter(e => targets[e].indexOf(reg) !== -1)

    for (let i of new_ks) {
        arr.push(i)
    }

    return arr
}

  targets["Северный Ауридон"] = getOther(['Валенвуд'], 'Северный Ауридон', ["Южный Ауридон"])
  targets["Южный Ауридон"] = getOther(['Валенвуд'],'Южный Ауридон', ["Северный Ауридон"])
  targets["Варилисс"] = getOther(['Валенвуд'],'Варилисс', ["Регион Алинор", "Шиммерен", "Орерри"])
  targets["Оррери"] = getOther(['Валенвуд'],'Оррери', ["Шиммерен", "Варилисс"])
  targets["Регион Алинор"] = getOther(['Валенвуд'],'Регион Алинор', ["Восточный полуостров", "Шиммерен", "Варилисс"])
  targets["Область Клаудрест"] = getOther(['Валенвуд'],'Область Клаудрест', ["Восточный полуостров", "Шиммерен"])
  targets["Шиммерен"] = getOther(['Валенвуд'],'Шиммерен', ["Восточный полуостров", "Область Клаудрест", "Регион Алинор", "Оррери", "Варилисс"])
  targets["Восточный полуостров"] = getOther(['Валенвуд'],'Восточный полуостров', ["Область Клаудрест", "Шиммерен", "Регион Алинор"])

  targets["Городской остров"] = getOther(['Валенвуд', 'Алинор'],'Городской остров', ["Графство Брума", "Графство Скинград", "Графство Коррол", "Графство Чейдинхол", "Графство Бравил"])
  targets["Графство Брума"] = getOther(['Валенвуд', 'Алинор'],'Графство Брума', ["Городской остров", "Графство Чейдинхол", "Графство Коррол", "Фолкрит"])
  targets["Графство Скинград"] = getOther(['Валенвуд', 'Алинор'],'Графство Скинград', ["Городской остров", "Графство Кватч", "Графство Коррол", "Графство Бравил", "Северная Анеквина"])
  targets["Графство Кватч"] = getOther(['Валенвуд', 'Алинор'],'Графство Кватч', ["Графство Анвил", "Графство Коррол", "Графство Скинград"])
  targets["Графство Анвил"] = getOther(['Валенвуд', 'Алинор'],'Графство Анвил', ["Республика Рихад", "Графство Кватч", "Графство Коррол"])
  targets["Графство Бравил"] = getOther(['Валенвуд', 'Алинор'],'Графство Бравил', ["ГГ Риммен", "Северная Анеквина", "Городской остров", "Графство Лейавин", "Графство Скинград", "Графство Чейдинхол", "Садрас", "Нага"])
  targets["Графство Лейавин"] = getOther(['Валенвуд', 'Алинор'],'Графство Лейавин', ["ГГ Риммен", "Регион Коринф", "Пустыня Эльсвейра", "Графство Бравил"])
  targets["Графство Чейдинхол"] = getOther(['Валенвуд', 'Алинор'],'Графство Чейдинхол', ["Городской остров", "Графство Брума", "Графство Бравил", "Редоран", "Садрас"])
  targets["Графство Коррол"] = getOther(['Валенвуд', 'Алинор'],'Графство Коррол', ["Графство Анвил", "Графство Кватч", "Графство Скинград", "Графство Брума", "Городской остров", "Фолкрит", "Республика Элинир", "Республика Рихад"])

  targets["Южный Индорил"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Южный Индорил', ["Садрас", "Торн", "Индорил"])
  targets["Торн"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Торн', ["Южный Индорил", "Нага", "Топкие болота", "Паатру"])
  targets["Нага"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Нага', ["Садрас", "Торн", "Топкие болота"])
  targets["Топкие болота"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Топкие болота', ["Нага", "Торн", "Паатру", "Ан-Зайлиль", "Гидеон"])
  targets["Гидеон"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Гидеон', ["Топкие болота", "Ан-Зайлиль", "Соулрест",])
  targets["Паатру"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Паатру', ["Торн", "Топкие болота", "Ан-Зайлиль", "Лилмот"])
  targets["Соулрест"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Соулрест', ["Гидеон", "Ан-Зайлиль", "Лилмот"])
  targets["Лилмот"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Лилмот', ["Ан-Зайлиль", "Соулрест", "Паатру"])
  targets["Ан-Зайлиль"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил'],'Ан-Зайлиль', ["Топкие болота", "Гидеон", "Лилмот", "Паатру", "Соулрест"])

  targets["ГГ Риммен"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Аргония'],'ГГ Риммен', ["Северная Анеквина", "Пустыня Эльсвейра",])
  targets["Западная Анеквина"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Аргония'],'Западная Анеквина', ["Северная Анеквина", "Регион Коринф", "Пустыня Эльсвейра",])
  targets["Пустыня Эльсвейра"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Аргония'],'Пустыня Эльсвейра', ["ГГ Риммен", "Северная Анеквина", "Западная Анеквина", "Регион Коринф"])
  targets["Северная Анеквина"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Аргония'],'Северная Анеквина', ["ГГ Риммен", "Пустыня Эльсвейра", "Западная Анеквина"])
  targets["Регион Коринф"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Аргония'],'Регион Коринф', ["Западная Анеквина", "Пустыня Эльсвейра", "Тенмарские леса"])
  targets["Тенмарские леса"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Аргония'],'Тенмарские леса', ["Регион Коринф", "Полуостров Куинравл",])
  targets["Полуостров Куинравл"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Аргония'],'Полуостров Куинравл', ["Тенмарские леса",])

  targets["Хаафингар"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Хаафингар', ["Хьялмарк", "Предел", "Кор-во Джеханна",])
  targets["Предел"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Предел', ["Кор-во Джеханна", "Хаафингар", "Республика Драгонстар", "Хьялмарк", "Фолкрит", "Вайтран",])
  targets["Фолкрит"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Фолкрит', ["Республика Элинир", "Предел", "Вайтран", "Рифт",])
  targets["Хьялмарк"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Хьялмарк', ["Белый Берег", "Хаафингар", "Предел", "Вайтран",])
  targets["Вайтран"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Вайтран', ["Предел", "Хьялмарк", "Фолкрит", "Белый Берег", "Истмарк", "Рифт",])
  targets["Белый Берег"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Белый Берег', ["Хьялмарк", "Вайтран", "Истмарк", "Винтерхолд",])
  targets["Винтерхолд"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Винтерхолд', ["Белый Берег", "Истмарк",])
  targets["Истмарк"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Истмарк', ["Белый Берег", "Вайтран", "Рифт", "Винтерхолд", "Редоран"])
  targets["Рифт"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония'],'Рифт', ["Фолкрит", "Вайтран", "Истмарк", "Редоран",])

  targets["Республика Элинир"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Республика Элинир', ["Республика Рихад", "Южный Скавен", "Республика Драгонстар", "Орсиниум",])
  targets["Регион Танет"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Регион Танет', ["Регион Гилан", "Южный Скавен", "Республика Рихад",])
  targets["Республика Рихад"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Республика Рихад', ["Регион Танет", "Южный Скавен", "Республика Элинир",])
  targets["Южный Скавен"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Южный Скавен', ["Республика Драгонстар", "Регион Танет", "Республика Рихад", "Республика Элинир", "Бангкорай", "Сентинель и Алик'р", "Регион Гилан", "Регион Хегат",])
  targets["Республика Драгонстар"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Республика Драгонстар', ["Орсиниум", "Республика Элинир", "Южный Скавен", "Бангкорай", "Кор-во Эвермор",])
  targets["Регион Хегат"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Регион Хегат', ["Сентинель и Алик'р", "Регион Гилан", "Южный Скавен",])
  targets["Регион Гилан"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Регион Гилан', ["Южный Скавен", "Регион Хегат", "Регион Танет",])
  targets["Остров Стросс м'кай"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],"Остров Стросс м'кай", [])
  targets["Сентинель и Алик'р"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'], "Сентинель и Алик'р", ["Бангкорай", "Регион Хегат", "Южный Скавен",])
  targets["Бангкорай"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Бангкорай', ["Республика Драгонстар", "Южный Скавен", "Сентинель и Алик'р", "Кор-во Вэйрест", "Кор-во Эвермор"])
  targets["Орсиниум"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Аргония', 'Скайрим'],'Орсиниум', ["Республика Элинир", "Республика Драгонстар",])

  targets["Северный Камлорн"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Северный Камлорн', ["Кор-во Даггерфолл", "Южный Камлорн", "Кор-во Шорнхельм", "Кор-во Нортпойнт",])
  targets["Кор-во Даггерфолл"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Кор-во Даггерфолл', ["Северный Камлорн", "Южный Камлорн",])
  targets["Кор-во Вэйрест"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Кор-во Вэйрест', ["Южный Камлорн", "Кор-во Шорнхельм", "Кор-во Эвермор",])
  targets["Южный Камлорн"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Южный Камлорн', ["Кор-во Вэйрест", "Кор-во Даггерфолл", "Северный Камлорн", "Кор-во Шорнхельм",])
  targets["Кор-во Шорнхельм"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Кор-во Шорнхельм', ["Кор-во Нортпойнт", "Кор-во Вэйрест", "Северный Камлорн", "Южный Камлорн", "Кор-во Эвермор", "Кор-во Фаррун",])
  targets["Кор-во Эвермор"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Кор-во Эвермор', ["Кор-во Вэйрест", "Кор-во Фаррун", "Кор-во Джеханна", "Кор-во Шорнхельм",])
  targets["Кор-во Джеханна"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Кор-во Джеханна', ["Кор-во Фаррун", "Кор-во Эвермор",])
  targets["Кор-во Нортпойнт"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Кор-во Нортпойнт', ["Кор-во Шорнхельм", "Северный Камлорн",])
  targets["Кор-во Фаррун"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Аргония'],'Кор-во Фаррун', ["Кор-во Джеханна", "Кор-во Шорнхельм", "Кор-во Эвермор",])

  targets["Солстхейм"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Солстхейм', ["Тель Митрин"])
  targets["Редоран"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Редоран', ["Садрас",])
  targets["Индорил"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Индорил', ["Садрас", "Южный Телванни",])
  targets["Тель Митрин"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Тель Митрин', ["Солстхейм",])
  targets["Острова Телванни"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Острова Телванни', [])
  targets["Горы Боэтии"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Горы Боэтии', ["Южный Телванни",])
  targets["Садрас"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Садрас', ["Редоран", "Индорил",])
  targets["Южный Телванни"] = getOther(['Валенвуд', 'Алинор', 'Сиродиил', 'Эльсвейр', 'Хаммерфелл', 'Скайрим', 'Хай-рок', 'Аргония'],'Южный Телванни', ["Горы Боэтии", "Индорил",])

  targets['sea_north'] = []
  targets['sea_east-north'] = []
  targets['sea_east'] = []
  targets['sea_east-south'] = []
  targets['sea_south'] = []
  targets['sea_west-south'] = []
  targets['sea_west-north'] = []
  targets['sea_center'] = []

export default targets